{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report listing two homepage AdSense placement features and their related files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend files including pages, components, hooks, and config.",
  "frontend/.env.example": "Environment variable template for configuring AdSense client and ad slot IDs.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with finance‑themed color tokens.",
  "frontend/index.html": "Main HTML entry that conditionally injects the AdSense script using Vite environment variables.",
  "frontend/src/App.tsx": "Wraps HomePage in ThemeProvider and includes global Toaster notifications.",
  "frontend/src/components/ads/AdSenseAd.tsx": "Reusable AdSense ad component that initializes ads, checks configuration, and provides fallbacks.",
  "frontend/src/config/adsense.ts": "Centralized module exposing AdSense client and slot IDs along with config and availability helpers.",
  "frontend/src/features/compare/components/ConversionWidget.tsx": "Currency conversion widget allowing amount entry and multi-currency comparisons using provided rates.",
  "frontend/src/features/compare/components/CurrencyComparePanel.tsx": "UI panel letting users pick up to three currencies to compare, validating selections and showing comparison widgets.",
  "frontend/src/features/compare/lib/conversion.ts": "Provides a utility function to convert currency amounts using rates relative to a base currency.",
  "frontend/src/features/rates/api/exchangeRates.ts": "Fetches latest exchange rates and available currencies from the Frankfurter API.",
  "frontend/src/features/rates/api/historicalRates.ts": "Retrieves and normalizes historical exchange rate data for a currency pair over a date range.",
  "frontend/src/features/rates/components/BaseCurrencySelect.tsx": "Dropdown component for choosing a base currency from available options.",
  "frontend/src/features/rates/components/DateRangePresets.tsx": "Renders quick-select buttons for predefined historical date ranges.",
  "frontend/src/features/rates/components/HistoricalRatesChart.tsx": "Generates an SVG line and area chart for historical exchange rate data.",
  "frontend/src/features/rates/components/HistoricalRatesPanel.tsx": "Panel showing historical rate chart, range presets, refresh controls, and error/loading states.",
  "frontend/src/features/rates/components/RatesTable.tsx": "Searchable, sortable table of exchange rates with error and loading handling.",
  "frontend/src/features/rates/components/RatesToolbar.tsx": "Toolbar displaying last updated timestamp and a refresh button for rates.",
  "frontend/src/features/rates/currencyMeta.ts": "Defines a map of currency codes to display names and a helper to retrieve a name or fallback code.",
  "frontend/src/features/rates/hooks/useHistoricalRates.ts": "React Query hook that fetches historical exchange rates based on a date range preset.",
  "frontend/src/features/rates/hooks/useLiveRates.ts": "React Query hook for fetching and auto‑refreshing live exchange rates for a base currency.",
  "frontend/src/features/rates/lib/dateRanges.ts": "Provides date range presets, utilities to compute ISO date ranges, and preset labels.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for backend-specific React Query hooks; currently unused.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Home page showing live rates, controls, ads, and optional historical charts.",
  "frontend/src/types/adsense.d.ts": "Type declaration for the global AdSense window object.",
  "frontend/tailwind.config.js": "Tailwind configuration with theme extensions, color variables, plugins, and container settings.",
  "project_state.json": "Stores project metadata, architectural notes, and a list of implemented features for the CurrencyPal app. Tracks version, planned domain setup, AdSense plans, and existing requirements."
}