{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing AdSense-related requirements and the files implementing them.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files used for quick reference in build planning.",
  "frontend/.env.example": "Example environment file defining AdSense client ID and optional ad slot IDs with defaults.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables for light and dark themes.",
  "frontend/index.html": "App entry HTML that injects the AdSense script once based on Vite environment variables.",
  "frontend/src/App.tsx": "Root React component that provides theming and renders the HomePage with notification support.",
  "frontend/src/components/ads/AdSenseAd.tsx": "Reusable AdSense ad component handling initialization, fallback behavior, and duplicate prevention.",
  "frontend/src/config/adsense.ts": "Centralized module exposing environment-based AdSense client and slot IDs with helper checks.",
  "frontend/src/features/compare/components/ConversionWidget.tsx": "Currency conversion UI widget allowing amount input and multi-currency conversions using provided rates.",
  "frontend/src/features/compare/components/CurrencyComparePanel.tsx": "UI panel for selecting up to three currencies and comparing their rates against a base currency with validation for duplicates and minimum selection.",
  "frontend/src/features/compare/lib/conversion.ts": "Utility to convert an amount between two currencies using rates relative to a base currency with basic validation.",
  "frontend/src/features/rates/api/exchangeRates.ts": "API helpers to fetch latest exchange rates and available currencies from the Frankfurter service.",
  "frontend/src/features/rates/api/historicalRates.ts": "API helper to fetch and transform historical exchange rate data over a date range for a currency pair.",
  "frontend/src/features/rates/components/BaseCurrencySelect.tsx": "Dropdown component for selecting a base currency with names resolved via metadata.",
  "frontend/src/features/rates/components/DateRangePresets.tsx": "Preset selector component for choosing predefined historical date ranges.",
  "frontend/src/features/rates/components/HistoricalRatesChart.tsx": "SVG-based chart component that renders historical rate data with scales, axes, line, and area fill.",
  "frontend/src/features/rates/components/HistoricalRatesPanel.tsx": "Panel wrapping presets, refresh controls, loading/error states, and the historical rates chart for a currency pair.",
  "frontend/src/features/rates/components/RatesTable.tsx": "Searchable, sortable table displaying exchange rates with error/loading handling and optional historical view triggers.",
  "frontend/src/features/rates/components/RatesToolbar.tsx": "Toolbar showing last-updated timestamp and a refresh button for reloading exchange rates.",
  "frontend/src/features/rates/currencyMeta.ts": "Defines a map of currency codes to display names and provides a helper to resolve names.",
  "frontend/src/features/rates/hooks/useHistoricalRates.ts": "React Query hook that fetches historical exchange rates based on a date range preset.",
  "frontend/src/features/rates/hooks/useLiveRates.ts": "React Query hook for polling live exchange rates with a 60‑second refresh interval.",
  "frontend/src/features/rates/lib/dateRanges.ts": "Utilities for computing ISO date ranges and labels for historical rate presets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating backend-specific hooks are unused for this app.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme color variables and global styles.",
  "frontend/src/main.tsx": "App entry point initializing React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/HomePage.tsx": "Home page UI combining live rates, controls, ads, and optional historical rate panels.",
  "frontend/src/types/adsense.d.ts": "Type declaration adding the adsbygoogle array to the Window interface.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, layout, and enabling plugins.",
  "project_state.json": "Stores project metadata, architectural notes on domain and AdSense setup, and a list of implemented features for the CurrencyPal app. Contains no code but tracks versions, requirements, and current project state."
}