{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of frontend file paths with brief descriptions for each component or module.",
  "frontend/index.css": "Tailwind base styles plus OKLCH‑based light/dark theme variables and global styling.",
  "frontend/index.html": "HTML entry point containing root div and module script loader for the React app.",
  "frontend/src/App.tsx": "Wraps HomePage with theme provider and notification toaster.",
  "frontend/src/features/compare/components/ConversionWidget.tsx": "Currency conversion widget allowing users to convert amounts between selected currencies.",
  "frontend/src/features/compare/components/CurrencyComparePanel.tsx": "Panel for selecting up to three currencies and viewing comparison and conversion results.",
  "frontend/src/features/compare/lib/conversion.ts": "Utility for converting amounts between currencies using base-relative rates.",
  "frontend/src/features/rates/api/exchangeRates.ts": "API module for fetching latest exchange rates and currency lists from Frankfurter.",
  "frontend/src/features/rates/api/historicalRates.ts": "Fetches and formats historical time‑series exchange rates for a currency pair.",
  "frontend/src/features/rates/components/BaseCurrencySelect.tsx": "Dropdown selector for choosing the base currency with names and loading support.",
  "frontend/src/features/rates/components/DateRangePresets.tsx": "Renders selectable date‑range preset buttons and notifies when the preset changes.",
  "frontend/src/features/rates/components/HistoricalRatesChart.tsx": "Generates an SVG line and area chart for historical exchange rates with computed scales and axes.",
  "frontend/src/features/rates/components/HistoricalRatesPanel.tsx": "Displays historical rate chart, range controls, loading/error states, and summary information.",
  "frontend/src/features/rates/components/RatesTable.tsx": "Shows a searchable, sortable table of exchange rates with loading and error handling.",
  "frontend/src/features/rates/components/RatesToolbar.tsx": "Displays last‑updated info and a refresh button for the rates list.",
  "frontend/src/features/rates/currencyMeta.ts": "Provides a map of currency codes to human‑readable names and a lookup helper.",
  "frontend/src/features/rates/hooks/useHistoricalRates.ts": "React Query hook that fetches historical exchange rates based on a selected date‑range preset.",
  "frontend/src/features/rates/hooks/useLiveRates.ts": "React Query hook that retrieves live exchange rates with periodic auto‑refresh.",
  "frontend/src/features/rates/lib/dateRanges.ts": "Defines date‑range presets and utilities to compute ISO date ranges and labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity authentication with AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for backend-specific React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, and dark mode color tokens for the app’s visual design.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/HomePage.tsx": "Implements the main dashboard page displaying live currency rates, controls, historical charts, and social links.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Stores project metadata, feature requirements, and current state for tracking development progress."
}