{
  "kind": "build_request",
  "title": "Move the AdSense block to an above-content placement on HomePage",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Update the HomePage layout so the AdSense block is positioned above the main content (directly under the sticky header and above the controls/content), matching the user’s selection of \"Above\" for ad placement.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Above"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, an AdSense ad unit is rendered directly below the sticky header and before the main content/controls section.",
        "The ad placement change does not break existing interactions (rates table search/sort, open/close historical panel, comparison panel).",
        "If AdSense is not configured or the ad slot is missing/empty, the existing fallback UI (“Ad space” / “Advertisement”) still renders and reserves space to keep layout stable."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure HomePage renders only the single above-content AdSense block (and does not render additional AdSense placements elsewhere on the Home page) to align with the single placement choice requested by the user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Above"
        ]
      },
      "acceptanceCriteria": [
        "The Home page contains exactly one <AdSenseAd /> placement.",
        "The ad is not rendered in the middle of the page content or near/above the footer once this change is implemented.",
        "No console errors are introduced by changing the number/position of ad units."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep AdSense initialization safe on the client (no repeated pushes causing errors on re-render/navigation)."
  ],
  "nonGoals": [
    "Adding new ad networks or non-AdSense monetization.",
    "Changing exchange-rate APIs, currency calculations, or historical chart logic.",
    "Backend changes (backend/main.mo) or any persistence/migration work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}