{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Move HomePage AdSense to single above-content placement",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Position the HomePage AdSense block directly below the sticky header and above the main content/controls area.",
      "acceptanceCriteria": [
        "On the Home page, an AdSense ad unit is rendered directly below the sticky header and before the main content/controls section.",
        "The ad placement change does not break existing interactions (rates table search/sort, open/close historical panel, comparison panel).",
        "If AdSense is not configured or the ad slot is missing/empty, the existing fallback UI (“Ad space” / “Advertisement”) still renders and reserves space to keep layout stable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Adjust the HomePage layout so the single AdSenseAd render is placed in the above-content position (directly after the sticky header and before the main content/controls), keeping existing spacing and ensuring the fallback placeholder continues to reserve height for layout stability. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Ensure HomePage renders exactly one AdSenseAd placement (above-content only) and removes any other Home page ad placements.",
      "acceptanceCriteria": [
        "The Home page contains exactly one <AdSenseAd /> placement.",
        "The ad is not rendered in the middle of the page content or near/above the footer once this change is implemented.",
        "No console errors are introduced by changing the number/position of ad units."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Remove the middle-page and footer AdSenseAd sections so the HomePage contains only one above-content AdSenseAd; update imports accordingly to avoid unused slot helpers and ensure no console warnings/errors are introduced by the reduced number of ad units. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}