{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Google AdSense head verification script and default env configuration",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Load the Google AdSense script in the document head on initial SPA load and prevent duplicate loader scripts",
      "acceptanceCriteria": [
        "On first load, the DOM contains a <script> element in <head> with src exactly `https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-5965886176480370`.",
        "The script tag has `async` enabled and `crossorigin=\"anonymous\"`.",
        "Navigating between routes/pages in the React SPA does not create additional duplicate AdSense script tags (only one AdSense loader script is present)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the existing head injection logic to ensure the AdSense loader script is appended to <head> on initial page load with async enabled and crossorigin=\"anonymous\", constructing the src exactly as `https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=${VITE_ADSENSE_CLIENT_ID}` when configured. Strengthen the no-duplicates guard by checking for an existing script tag with the same computed src (not only by element id), so repeated evaluations or future changes cannot create duplicate AdSense loader script tags."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Set default developer env example for VITE_ADSENSE_CLIENT_ID while keeping the env-driven AdSense loading flow compatible",
      "acceptanceCriteria": [
        "`frontend/.env.example` contains `VITE_ADSENSE_CLIENT_ID=ca-pub-5965886176480370` (exact value).",
        "With `VITE_ADSENSE_CLIENT_ID` set to `ca-pub-5965886176480370`, the site loads the AdSense script successfully (no missing-client-id state for AdSense)."
      ],
      "file_operations": [
        {
          "path": "frontend/.env.example",
          "operation": "modify",
          "description": "Set `VITE_ADSENSE_CLIENT_ID=ca-pub-5965886176480370` as the default example value, leaving the rest of the AdSense-related variables unchanged so the existing environment-variable-based setup remains the source of truth for AdSense configuration."
        }
      ]
    }
  ]
}